{
  "title": "OAuth",
  "cells": [
    {
      "type": "markdown",
      "data": "OAuth is a standard protocol that allows users to authorize API access to web and desktop or mobile applications. Once access has been granted, the authorized application can utilize the API on behalf of the user. OAuth has also emerged as a popular mechanism for delegated authentication.\n\nOAuth comes in two primary flavors, both of which are widely deployed.\n\nThe initial version of OAuth was developed as an open standard by a loosely organized collective of web developers. Their work resulted in OAuth 1.0, which was superseded by OAuth 1.0a. This work has now been standardized by the IETF as RFC 5849.\n\nRecent efforts undertaken by the Web Authorization Protocol Working Group have focused on defining OAuth 2.0. Due to the lengthy standardization effort, providers have proceeded to deploy implementations conforming to various drafts, each with slightly different semantics.\n\nThankfully, Passport shields an application from the complexities of dealing with OAuth variants. In many cases, a provider-specific strategy can be used instead of the generic OAuth strategies described below. This cuts down on the necessary configuration, and accommodates any provider-specific quirks. See Facebook, Twitter or the list of providers for preferred usage.\n\nSupport for OAuth is provided by the passport-oauth module.\n\n# Install\n\n`$ npm install passport-oauth`\n\n# OAuth 1.0\n\nOAuth 1.0 is a delegated authentication strategy that involves multiple steps. First, a request token must be obtained. Next, the user is redirected to the service provider to authorize access. Finally, after authorization has been granted, the user is redirected back to the application and the request token can be exchanged for an access token. The application requesting access, known as a consumer, is identified by a consumer key and consumer secret."
    },
    {
      "type": "code",
      "language": "javascript",
      "data": "//Configuration\n\n//When using the generic OAuth strategy, the key, secret, and endpoints are specified as options.\n\nvar passport = require('passport')\n  , OAuthStrategy = require('passport-oauth').OAuthStrategy;\n\npassport.use('provider', new OAuthStrategy({\n    requestTokenURL: 'https://www.provider.com/oauth/request_token',\n    accessTokenURL: 'https://www.provider.com/oauth/access_token',\n    userAuthorizationURL: 'https://www.provider.com/oauth/authorize',\n    consumerKey: '123-456-789',\n    consumerSecret: 'shhh-its-a-secret'\n    callbackURL: 'https://www.example.com/auth/provider/callback'\n  },\n  function(token, tokenSecret, profile, done) {\n    User.findOrCreate(..., function(err, user) {\n      done(err, user);\n    });\n  }\n));\n\n//The verify callback for OAuth-based strategies accepts token, tokenSecret, and profile arguments. token is the access token and tokenSecret is its corresponding secret. profile will contain user profile information provided by the service provider; refer to User Profile for additional information."
    }
  ]
}