{
  "title": "Tools in the JS Ecosystem",
  "cells": [
    {
      "type": "markdown",
      "data": "#Tools in the JS Ecosystem\n\nIt’s the most common complaint heard by JavaScript Developers: WHY ARE THERE SO MANY TOOLS OUT THERE!?\n\nIn this session, we will cut through the noise and survey the most common tools in the JavaScript developer’s tool chest. How do front-end frameworks compare? What should you look out for? Is JS on the back-end the real deal? Let’s explore...\n\n\n- [ ] It all started with ajax\n- [ ] All praise jquery\n- [ ] The explosion\n- [ ] The divide frontend vs backend\n- [ ] The leaders of the pack\n- [ ] The Future\n\n##It all started with ajax\n10 days in May 1995 by Brendan Eich - \n1998, Microsoft Outlook Web App team implemented the first component XMLHTTP by client script.\nXMLHttpRequest object was published on 30 January 2014.\n\n##All praise jquery\nJohn Resig\nJanuary 14th, 2006 - jQuery Announced at BarCampNYC: BarCampNYC Wrap-up \nFebruary 26th, 2006 - Ajax added to jQuery: Ajax, new fx, and more!\nAugust 26th, 2006 - First stable version of jQuery: jQuery 1.0\n\n##The explosion\nAs the use of javascript grew out of it's DOM manipulation phase into 'the language of the web' we saw a rapid growth in attempts to make large JS applications more manageable. The wild and wooly times. Many solutions for small problems popped up. Usually in a bit of a disjointed way. How many times has the problem of a carousel or a lightbox been solved? Or date pickers, or blah blah blah.\n\nDojo Toolkit - by Alex Russell, Dylan Schiemann, David Schontzler, and others in 2004\nprototype.js - \tsstephenson February 2005\nYUI Library - YUI was released for public use in February 2006.\nExt JS - Originally an addon for YUI by Jack Slocum April 15, 2007\nUnderscore.js - jashkenas committed on Oct 25, 2009\n\n##The leaders of the pack\nbackbone.js - jashkenas tagged this on Oct 13, 2010 · 3255 commits to master since this tag\nangularjs - IgorMinar tagged this on Oct 20, 2010 · 8056 commits to master since this tag\nreact - zpao released this on Jul 2, 2013 · 8699 commits to master since this release\nvuejs -  yyx990803 February 2014; 3 years ago\n\n##The divide frontend vs backend\nWith the advent of Rhino, javascript was no longer tied to the DOM. This allowed for a single language to handle the entirety of the process. Java and PHP still dominated but Rhino survived. \n\n##The Future\n\nJS evolving with TypeScript / Flow / Web Assembly"
    }
  ]
}